TestCases/Silicone_Exp/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Xiang - Need to change mesh to bubbling test 

vertices
(
    (0    0    0)
    (0.04 0    0)
    (0.04 0.04 0)
    (0 0.04    0)
    
    
    (0    0    0.07)
    (0.04 0    0.07)
    (0.04 0.04 0.07)
    (0    0.04 0.07)
    
    
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 35) simpleGrading (1 1 1) 
); 

edges
(
);

boundary
(

    Walls
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (0 4 7 3)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
